def area(a, b):
    '''
    Возвращает площадь прямоугольника
    
        Параметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника
            
        Возвращаемое значение:
            a * b: искомая площадь прямоугольника
    '''
    return a * b
    
def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника
    
        Парaметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника
            
        Возвращаемое значение:
            (a + b) * 2: искомый периметр прямоугольника
    '''
    
    return (a + b) * 2
