
def area(a):
    '''
    Возвращает площадь квадрата.
    
        Параметры:
            a (int): длина квадрата
            a (int): ширина квадрата

        Возвращаемое значение:
            a * a: искомая площадь треугольника
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

        Параметры:
            a (int): длина квадрата
            a (int): ширина квадрата

        Возвращаемое значение:
            4 * a: искомая периметр треугольника
    '''
    return 4 * a
