# Эта функция вычисляет площадь квадрата.

# Она принимает длину стороны квадрата (а) в качестве аргумента.
# Формула для вычисления площади квадрата : площадь = а * а
# Пример:

#Если вы передадите функции длину стороны 3, она вернет площадь квадрата, равную 9.

#>>>area (3)
# 9
def area(a):
    return a * a

# Эта функция вычисляет периметр квадрата.
# Она принимает длину стороны квадрата (а) в качестве аргумента.
#Формула для вычисления периметра квадрата: периметр = 4 * а
#Пример:
# Если вы передадите функции длину стороны 3, она вернет периметр квадрата, равный 12.
#>>> perimeter(3)
#12

def perimeter(a):
    return 4 * a
