
def area(a):
    """
    Возвращает площадь квадрата
    (по формуле длина стороны в квадрате)

        Параметры:
            a (int): длина стороны

        Возвращаемое значение:
            a * a (int): площадь квадрата с заданными параметрами
    """
    return a * a


def perimeter(a):
    """
    Возвращает периметр квадрата
    (по формуле 4 длины стороны)

        Параметры:
            a (int): длина стороны

        Возвращаемое значение:
            4 * a (int): периметр квадрата с заданными параметрами
    """
    return 4 * a
