def area(a, b, c):
'''
    Вычисляет полупериметр треугольника по заданным длинам сторон.
        Параметры:
            a (float) - длина стороны треугольника 1
            b (float) - длина стороны треугольника 2
            c (float) - длина стороны треугольника 3
        Возвращаемое значение:
            (float) - полупериметр треугольника

'''
    return (a + b + c) / 2


def perimeter(a, b, c):
'''
    Вычисляет периметр треугольника по длинам сторон
        Параметры:
            a (float) - длина стороны треугольника 1
            b (float) - длина стороны треугольника 2
            c (float) - длина стороны треугольника 3
        Возвращаемое значение:
            (float) - полупериметр треугольника
'''
    return a + b + c
