def area(a, h):
''' Находит площадь треугольника
    Параметры:
        a (double): сторона треугольника
        h (double): высота треугольника
    Возвращаемые значения:
        triangle_area (double): площадь треугольника
 '''
    return a * h
def perimeter(a, b, c):
''' Находит периметр треугольника
    Параметры:
        a (double): первая сторона
        b (double): вторая сторона
        c (double): третья сторона
    Возвращаемые значения:
        trian_perimeter (double): длина треугольника
 '''
    return a + b + c
